valtlInf/xensiv-magnetic-sensors-sw-examples/Angle-Sensors/Aurix/TLE5502/TLE5502_TC334_IntegrationExample/TLE5502_AurixCalibOneTime/Libraries/Infra/Sfr/TC33x/IfxEray_bf.h
/** \brief Offset for Ifx_ERAY_RCV_Bits.RCV */
#define IFX_ERAY_RCV_RCV_OFF (0u)

/** \brief Length for Ifx_ERAY_OCV_Bits.OCV */
#define IFX_ERAY_OCV_OCV_LEN (19u)

/** \brief Mask for Ifx_ERAY_OCV_Bits.OCV */
#define IFX_ERAY_OCV_OCV_MSK (0x7ffffu)

/** \brief Offset for Ifx_ERAY_OCV_Bits.OCV */
#define IFX_ERAY_OCV_OCV_OFF (0u)

/** \brief Length for Ifx_ERAY_SFS_Bits.VSAE */
#define IFX_ERAY_SFS_VSAE_LEN (4u)

/** \brief Mask for Ifx_ERAY_SFS_Bits.VSAE */
#define IFX_ERAY_SFS_VSAE_MSK (0xfu)

/** \brief Offset for Ifx_ERAY_SFS_Bits.VSAE */
#define IFX_ERAY_SFS_VSAE_OFF (0u)

/** \brief Length for Ifx_ERAY_SFS_Bits.VSAO */
#define IFX_ERAY_SFS_VSAO_LEN (4u)

/** \brief Mask for Ifx_ERAY_SFS_Bits.VSAO */
#define IFX_ERAY_SFS_VSAO_MSK (0xfu)

/** \brief Offset for Ifx_ERAY_SFS_Bits.VSAO */
#define IFX_ERAY_SFS_VSAO_OFF (4u)

/** \brief Length for Ifx_ERAY_SFS_Bits.VSBE */
#define IFX_ERAY_SFS_VSBE_LEN (4u)

/** \brief Mask for Ifx_ERAY_SFS_Bits.VSBE */
#define IFX_ERAY_SFS_VSBE_MSK (0xfu)

/** \brief Offset for Ifx_ERAY_SFS_Bits.VSBE */
#define IFX_ERAY_SFS_VSBE_OFF (8u)

/** \brief Length for Ifx_ERAY_SFS_Bits.VSBO */
#define IFX_ERAY_SFS_VSBO_LEN (4u)

/** \brief Mask for Ifx_ERAY_SFS_Bits.VSBO */
#define IFX_ERAY_SFS_VSBO_MSK (0xfu)

/** \brief Offset for Ifx_ERAY_SFS_Bits.VSBO */
#define IFX_ERAY_SFS_VSBO_OFF (12u)

/** \brief Length for Ifx_ERAY_SFS_Bits.MOCS */
#define IFX_ERAY_SFS_MOCS_LEN (1u)

/** \brief Mask for Ifx_ERAY_SFS_Bits.MOCS */
#define IFX_ERAY_SFS_MOCS_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SFS_Bits.MOCS */
#define IFX_ERAY_SFS_MOCS_OFF (16u)

/** \brief Length for Ifx_ERAY_SFS_Bits.OCLR */
#define IFX_ERAY_SFS_OCLR_LEN (1u)

/** \brief Mask for Ifx_ERAY_SFS_Bits.OCLR */
#define IFX_ERAY_SFS_OCLR_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SFS_Bits.OCLR */
#define IFX_ERAY_SFS_OCLR_OFF (17u)

/** \brief Length for Ifx_ERAY_SFS_Bits.MRCS */
#define IFX_ERAY_SFS_MRCS_LEN (1u)

/** \brief Mask for Ifx_ERAY_SFS_Bits.MRCS */
#define IFX_ERAY_SFS_MRCS_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SFS_Bits.MRCS */
#define IFX_ERAY_SFS_MRCS_OFF (18u)

/** \brief Length for Ifx_ERAY_SFS_Bits.RCLR */
#define IFX_ERAY_SFS_RCLR_LEN (1u)

/** \brief Mask for Ifx_ERAY_SFS_Bits.RCLR */
#define IFX_ERAY_SFS_RCLR_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SFS_Bits.RCLR */
#define IFX_ERAY_SFS_RCLR_OFF (19u)

/** \brief Length for Ifx_ERAY_SWNIT_Bits.SESA */
#define IFX_ERAY_SWNIT_SESA_LEN (1u)

/** \brief Mask for Ifx_ERAY_SWNIT_Bits.SESA */
#define IFX_ERAY_SWNIT_SESA_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SWNIT_Bits.SESA */
#define IFX_ERAY_SWNIT_SESA_OFF (0u)

/** \brief Length for Ifx_ERAY_SWNIT_Bits.SBSA */
#define IFX_ERAY_SWNIT_SBSA_LEN (1u)

/** \brief Mask for Ifx_ERAY_SWNIT_Bits.SBSA */
#define IFX_ERAY_SWNIT_SBSA_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SWNIT_Bits.SBSA */
#define IFX_ERAY_SWNIT_SBSA_OFF (1u)

/** \brief Length for Ifx_ERAY_SWNIT_Bits.TCSA */
#define IFX_ERAY_SWNIT_TCSA_LEN (1u)

/** \brief Mask for Ifx_ERAY_SWNIT_Bits.TCSA */
#define IFX_ERAY_SWNIT_TCSA_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SWNIT_Bits.TCSA */
#define IFX_ERAY_SWNIT_TCSA_OFF (2u)

/** \brief Length for Ifx_ERAY_SWNIT_Bits.SESB */
#define IFX_ERAY_SWNIT_SESB_LEN (1u)

/** \brief Mask for Ifx_ERAY_SWNIT_Bits.SESB */
#define IFX_ERAY_SWNIT_SESB_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SWNIT_Bits.SESB */
#define IFX_ERAY_SWNIT_SESB_OFF (3u)

/** \brief Length for Ifx_ERAY_SWNIT_Bits.SBSB */
#define IFX_ERAY_SWNIT_SBSB_LEN (1u)

/** \brief Mask for Ifx_ERAY_SWNIT_Bits.SBSB */
#define IFX_ERAY_SWNIT_SBSB_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SWNIT_Bits.SBSB */
#define IFX_ERAY_SWNIT_SBSB_OFF (4u)

/** \brief Length for Ifx_ERAY_SWNIT_Bits.TCSB */
#define IFX_ERAY_SWNIT_TCSB_LEN (1u)

/** \brief Mask for Ifx_ERAY_SWNIT_Bits.TCSB */
#define IFX_ERAY_SWNIT_TCSB_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SWNIT_Bits.TCSB */
#define IFX_ERAY_SWNIT_TCSB_OFF (5u)

/** \brief Length for Ifx_ERAY_SWNIT_Bits.MTSA */
#define IFX_ERAY_SWNIT_MTSA_LEN (1u)

/** \brief Mask for Ifx_ERAY_SWNIT_Bits.MTSA */
#define IFX_ERAY_SWNIT_MTSA_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SWNIT_Bits.MTSA */
#define IFX_ERAY_SWNIT_MTSA_OFF (6u)

/** \brief Length for Ifx_ERAY_SWNIT_Bits.MTSB */
#define IFX_ERAY_SWNIT_MTSB_LEN (1u)

/** \brief Mask for Ifx_ERAY_SWNIT_Bits.MTSB */
#define IFX_ERAY_SWNIT_MTSB_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SWNIT_Bits.MTSB */
#define IFX_ERAY_SWNIT_MTSB_OFF (7u)

/** \brief Length for Ifx_ERAY_SWNIT_Bits.SENA */
#define IFX_ERAY_SWNIT_SENA_LEN (1u)

/** \brief Mask for Ifx_ERAY_SWNIT_Bits.SENA */
#define IFX_ERAY_SWNIT_SENA_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SWNIT_Bits.SENA */
#define IFX_ERAY_SWNIT_SENA_OFF (8u)

/** \brief Length for Ifx_ERAY_SWNIT_Bits.SBNA */
#define IFX_ERAY_SWNIT_SBNA_LEN (1u)

/** \brief Mask for Ifx_ERAY_SWNIT_Bits.SBNA */
#define IFX_ERAY_SWNIT_SBNA_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SWNIT_Bits.SBNA */
#define IFX_ERAY_SWNIT_SBNA_OFF (9u)

/** \brief Length for Ifx_ERAY_SWNIT_Bits.SENB */
#define IFX_ERAY_SWNIT_SENB_LEN (1u)

/** \brief Mask for Ifx_ERAY_SWNIT_Bits.SENB */
#define IFX_ERAY_SWNIT_SENB_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SWNIT_Bits.SENB */
#define IFX_ERAY_SWNIT_SENB_OFF (10u)

/** \brief Length for Ifx_ERAY_SWNIT_Bits.SBNB */
#define IFX_ERAY_SWNIT_SBNB_LEN (1u)

/** \brief Mask for Ifx_ERAY_SWNIT_Bits.SBNB */
#define IFX_ERAY_SWNIT_SBNB_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SWNIT_Bits.SBNB */
#define IFX_ERAY_SWNIT_SBNB_OFF (11u)

/** \brief Length for Ifx_ERAY_ACS_Bits.VFRA */
#define IFX_ERAY_ACS_VFRA_LEN (1u)

/** \brief Mask for Ifx_ERAY_ACS_Bits.VFRA */
#define IFX_ERAY_ACS_VFRA_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_ACS_Bits.VFRA */
#define IFX_ERAY_ACS_VFRA_OFF (0u)

/** \brief Length for Ifx_ERAY_ACS_Bits.SEDA */
#define IFX_ERAY_ACS_SEDA_LEN (1u)

/** \brief Mask for Ifx_ERAY_ACS_Bits.SEDA */
#define IFX_ERAY_ACS_SEDA_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_ACS_Bits.SEDA */
#define IFX_ERAY_ACS_SEDA_OFF (1u)

/** \brief Length for Ifx_ERAY_ACS_Bits.CEDA */
#define IFX_ERAY_ACS_CEDA_LEN (1u)

/** \brief Mask for Ifx_ERAY_ACS_Bits.CEDA */
#define IFX_ERAY_ACS_CEDA_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_ACS_Bits.CEDA */
#define IFX_ERAY_ACS_CEDA_OFF (2u)

/** \brief Length for Ifx_ERAY_ACS_Bits.CIA */
#define IFX_ERAY_ACS_CIA_LEN (1u)

/** \brief Mask for Ifx_ERAY_ACS_Bits.CIA */
#define IFX_ERAY_ACS_CIA_MSK (0x1u)

