valtlInf/xensiv-magnetic-sensors-sw-examples/Angle-Sensors/Aurix/TLE5502/TLE5502_TC334_IntegrationExample/TLE5502_AurixCalibOneTime/Libraries/Infra/Sfr/TC33x/IfxEray_bf.h
/** \brief Offset for Ifx_ERAY_NDIC3_Bits.NDIP86 */
#define IFX_ERAY_NDIC3_NDIP86_OFF (22u)

/** \brief Length for Ifx_ERAY_NDIC3_Bits.NDIP87 */
#define IFX_ERAY_NDIC3_NDIP87_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC3_Bits.NDIP87 */
#define IFX_ERAY_NDIC3_NDIP87_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC3_Bits.NDIP87 */
#define IFX_ERAY_NDIC3_NDIP87_OFF (23u)

/** \brief Length for Ifx_ERAY_NDIC3_Bits.NDIP88 */
#define IFX_ERAY_NDIC3_NDIP88_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC3_Bits.NDIP88 */
#define IFX_ERAY_NDIC3_NDIP88_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC3_Bits.NDIP88 */
#define IFX_ERAY_NDIC3_NDIP88_OFF (24u)

/** \brief Length for Ifx_ERAY_NDIC3_Bits.NDIP89 */
#define IFX_ERAY_NDIC3_NDIP89_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC3_Bits.NDIP89 */
#define IFX_ERAY_NDIC3_NDIP89_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC3_Bits.NDIP89 */
#define IFX_ERAY_NDIC3_NDIP89_OFF (25u)

/** \brief Length for Ifx_ERAY_NDIC3_Bits.NDIP90 */
#define IFX_ERAY_NDIC3_NDIP90_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC3_Bits.NDIP90 */
#define IFX_ERAY_NDIC3_NDIP90_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC3_Bits.NDIP90 */
#define IFX_ERAY_NDIC3_NDIP90_OFF (26u)

/** \brief Length for Ifx_ERAY_NDIC3_Bits.NDIP91 */
#define IFX_ERAY_NDIC3_NDIP91_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC3_Bits.NDIP91 */
#define IFX_ERAY_NDIC3_NDIP91_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC3_Bits.NDIP91 */
#define IFX_ERAY_NDIC3_NDIP91_OFF (27u)

/** \brief Length for Ifx_ERAY_NDIC3_Bits.NDIP92 */
#define IFX_ERAY_NDIC3_NDIP92_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC3_Bits.NDIP92 */
#define IFX_ERAY_NDIC3_NDIP92_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC3_Bits.NDIP92 */
#define IFX_ERAY_NDIC3_NDIP92_OFF (28u)

/** \brief Length for Ifx_ERAY_NDIC3_Bits.NDIP93 */
#define IFX_ERAY_NDIC3_NDIP93_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC3_Bits.NDIP93 */
#define IFX_ERAY_NDIC3_NDIP93_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC3_Bits.NDIP93 */
#define IFX_ERAY_NDIC3_NDIP93_OFF (29u)

/** \brief Length for Ifx_ERAY_NDIC3_Bits.NDIP94 */
#define IFX_ERAY_NDIC3_NDIP94_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC3_Bits.NDIP94 */
#define IFX_ERAY_NDIC3_NDIP94_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC3_Bits.NDIP94 */
#define IFX_ERAY_NDIC3_NDIP94_OFF (30u)

/** \brief Length for Ifx_ERAY_NDIC3_Bits.NDIP95 */
#define IFX_ERAY_NDIC3_NDIP95_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC3_Bits.NDIP95 */
#define IFX_ERAY_NDIC3_NDIP95_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC3_Bits.NDIP95 */
#define IFX_ERAY_NDIC3_NDIP95_OFF (31u)

/** \brief Length for Ifx_ERAY_NDIC4_Bits.NDIP96 */
#define IFX_ERAY_NDIC4_NDIP96_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC4_Bits.NDIP96 */
#define IFX_ERAY_NDIC4_NDIP96_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC4_Bits.NDIP96 */
#define IFX_ERAY_NDIC4_NDIP96_OFF (0u)

/** \brief Length for Ifx_ERAY_NDIC4_Bits.NDIP97 */
#define IFX_ERAY_NDIC4_NDIP97_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC4_Bits.NDIP97 */
#define IFX_ERAY_NDIC4_NDIP97_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC4_Bits.NDIP97 */
#define IFX_ERAY_NDIC4_NDIP97_OFF (1u)

/** \brief Length for Ifx_ERAY_NDIC4_Bits.NDIP98 */
#define IFX_ERAY_NDIC4_NDIP98_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC4_Bits.NDIP98 */
#define IFX_ERAY_NDIC4_NDIP98_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC4_Bits.NDIP98 */
#define IFX_ERAY_NDIC4_NDIP98_OFF (2u)

/** \brief Length for Ifx_ERAY_NDIC4_Bits.NDIP99 */
#define IFX_ERAY_NDIC4_NDIP99_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC4_Bits.NDIP99 */
#define IFX_ERAY_NDIC4_NDIP99_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC4_Bits.NDIP99 */
#define IFX_ERAY_NDIC4_NDIP99_OFF (3u)

/** \brief Length for Ifx_ERAY_NDIC4_Bits.NDIP100 */
#define IFX_ERAY_NDIC4_NDIP100_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC4_Bits.NDIP100 */
#define IFX_ERAY_NDIC4_NDIP100_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC4_Bits.NDIP100 */
#define IFX_ERAY_NDIC4_NDIP100_OFF (4u)

/** \brief Length for Ifx_ERAY_NDIC4_Bits.NDIP101 */
#define IFX_ERAY_NDIC4_NDIP101_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC4_Bits.NDIP101 */
#define IFX_ERAY_NDIC4_NDIP101_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC4_Bits.NDIP101 */
#define IFX_ERAY_NDIC4_NDIP101_OFF (5u)

/** \brief Length for Ifx_ERAY_NDIC4_Bits.NDIP102 */
#define IFX_ERAY_NDIC4_NDIP102_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC4_Bits.NDIP102 */
#define IFX_ERAY_NDIC4_NDIP102_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC4_Bits.NDIP102 */
#define IFX_ERAY_NDIC4_NDIP102_OFF (6u)

/** \brief Length for Ifx_ERAY_NDIC4_Bits.NDIP103 */
#define IFX_ERAY_NDIC4_NDIP103_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC4_Bits.NDIP103 */
#define IFX_ERAY_NDIC4_NDIP103_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC4_Bits.NDIP103 */
#define IFX_ERAY_NDIC4_NDIP103_OFF (7u)

/** \brief Length for Ifx_ERAY_NDIC4_Bits.NDIP104 */
#define IFX_ERAY_NDIC4_NDIP104_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC4_Bits.NDIP104 */
#define IFX_ERAY_NDIC4_NDIP104_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC4_Bits.NDIP104 */
#define IFX_ERAY_NDIC4_NDIP104_OFF (8u)

/** \brief Length for Ifx_ERAY_NDIC4_Bits.NDIP105 */
#define IFX_ERAY_NDIC4_NDIP105_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC4_Bits.NDIP105 */
#define IFX_ERAY_NDIC4_NDIP105_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC4_Bits.NDIP105 */
#define IFX_ERAY_NDIC4_NDIP105_OFF (9u)

/** \brief Length for Ifx_ERAY_NDIC4_Bits.NDIP106 */
#define IFX_ERAY_NDIC4_NDIP106_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC4_Bits.NDIP106 */
#define IFX_ERAY_NDIC4_NDIP106_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC4_Bits.NDIP106 */
#define IFX_ERAY_NDIC4_NDIP106_OFF (10u)

/** \brief Length for Ifx_ERAY_NDIC4_Bits.NDIP107 */
#define IFX_ERAY_NDIC4_NDIP107_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC4_Bits.NDIP107 */
#define IFX_ERAY_NDIC4_NDIP107_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC4_Bits.NDIP107 */
#define IFX_ERAY_NDIC4_NDIP107_OFF (11u)

/** \brief Length for Ifx_ERAY_NDIC4_Bits.NDIP108 */
#define IFX_ERAY_NDIC4_NDIP108_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC4_Bits.NDIP108 */
#define IFX_ERAY_NDIC4_NDIP108_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC4_Bits.NDIP108 */
#define IFX_ERAY_NDIC4_NDIP108_OFF (12u)

/** \brief Length for Ifx_ERAY_NDIC4_Bits.NDIP109 */
#define IFX_ERAY_NDIC4_NDIP109_LEN (1u)

