valtlInf/xensiv-magnetic-sensors-sw-examples/Angle-Sensors/Aurix/TLE5502/TLE5502_TC334_IntegrationExample/TLE5502_AurixCalibOneTime/Libraries/Infra/Sfr/TC33x/IfxEray_bf.h
/** \brief Offset for Ifx_ERAY_MBS_Bits.SVOA */
#define IFX_ERAY_MBS_SVOA_OFF (6u)

/** \brief Length for Ifx_ERAY_MBS_Bits.SVOB */
#define IFX_ERAY_MBS_SVOB_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBS_Bits.SVOB */
#define IFX_ERAY_MBS_SVOB_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBS_Bits.SVOB */
#define IFX_ERAY_MBS_SVOB_OFF (7u)

/** \brief Length for Ifx_ERAY_MBS_Bits.TCIA */
#define IFX_ERAY_MBS_TCIA_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBS_Bits.TCIA */
#define IFX_ERAY_MBS_TCIA_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBS_Bits.TCIA */
#define IFX_ERAY_MBS_TCIA_OFF (8u)

/** \brief Length for Ifx_ERAY_MBS_Bits.TCIB */
#define IFX_ERAY_MBS_TCIB_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBS_Bits.TCIB */
#define IFX_ERAY_MBS_TCIB_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBS_Bits.TCIB */
#define IFX_ERAY_MBS_TCIB_OFF (9u)

/** \brief Length for Ifx_ERAY_MBS_Bits.ESA */
#define IFX_ERAY_MBS_ESA_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBS_Bits.ESA */
#define IFX_ERAY_MBS_ESA_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBS_Bits.ESA */
#define IFX_ERAY_MBS_ESA_OFF (10u)

/** \brief Length for Ifx_ERAY_MBS_Bits.ESB */
#define IFX_ERAY_MBS_ESB_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBS_Bits.ESB */
#define IFX_ERAY_MBS_ESB_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBS_Bits.ESB */
#define IFX_ERAY_MBS_ESB_OFF (11u)

/** \brief Length for Ifx_ERAY_MBS_Bits.MLST */
#define IFX_ERAY_MBS_MLST_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBS_Bits.MLST */
#define IFX_ERAY_MBS_MLST_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBS_Bits.MLST */
#define IFX_ERAY_MBS_MLST_OFF (12u)

/** \brief Length for Ifx_ERAY_MBS_Bits.FTA */
#define IFX_ERAY_MBS_FTA_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBS_Bits.FTA */
#define IFX_ERAY_MBS_FTA_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBS_Bits.FTA */
#define IFX_ERAY_MBS_FTA_OFF (14u)

/** \brief Length for Ifx_ERAY_MBS_Bits.FTB */
#define IFX_ERAY_MBS_FTB_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBS_Bits.FTB */
#define IFX_ERAY_MBS_FTB_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBS_Bits.FTB */
#define IFX_ERAY_MBS_FTB_OFF (15u)

/** \brief Length for Ifx_ERAY_MBS_Bits.CCS */
#define IFX_ERAY_MBS_CCS_LEN (6u)

/** \brief Mask for Ifx_ERAY_MBS_Bits.CCS */
#define IFX_ERAY_MBS_CCS_MSK (0x3fu)

/** \brief Offset for Ifx_ERAY_MBS_Bits.CCS */
#define IFX_ERAY_MBS_CCS_OFF (16u)

/** \brief Length for Ifx_ERAY_MBS_Bits.RCIS */
#define IFX_ERAY_MBS_RCIS_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBS_Bits.RCIS */
#define IFX_ERAY_MBS_RCIS_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBS_Bits.RCIS */
#define IFX_ERAY_MBS_RCIS_OFF (24u)

/** \brief Length for Ifx_ERAY_MBS_Bits.SFIS */
#define IFX_ERAY_MBS_SFIS_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBS_Bits.SFIS */
#define IFX_ERAY_MBS_SFIS_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBS_Bits.SFIS */
#define IFX_ERAY_MBS_SFIS_OFF (25u)

/** \brief Length for Ifx_ERAY_MBS_Bits.SYNS */
#define IFX_ERAY_MBS_SYNS_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBS_Bits.SYNS */
#define IFX_ERAY_MBS_SYNS_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBS_Bits.SYNS */
#define IFX_ERAY_MBS_SYNS_OFF (26u)

/** \brief Length for Ifx_ERAY_MBS_Bits.NFIS */
#define IFX_ERAY_MBS_NFIS_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBS_Bits.NFIS */
#define IFX_ERAY_MBS_NFIS_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBS_Bits.NFIS */
#define IFX_ERAY_MBS_NFIS_OFF (27u)

/** \brief Length for Ifx_ERAY_MBS_Bits.PPIS */
#define IFX_ERAY_MBS_PPIS_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBS_Bits.PPIS */
#define IFX_ERAY_MBS_PPIS_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBS_Bits.PPIS */
#define IFX_ERAY_MBS_PPIS_OFF (28u)

/** \brief Length for Ifx_ERAY_OBCM_Bits.RHSS */
#define IFX_ERAY_OBCM_RHSS_LEN (1u)

/** \brief Mask for Ifx_ERAY_OBCM_Bits.RHSS */
#define IFX_ERAY_OBCM_RHSS_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_OBCM_Bits.RHSS */
#define IFX_ERAY_OBCM_RHSS_OFF (0u)

/** \brief Length for Ifx_ERAY_OBCM_Bits.RDSS */
#define IFX_ERAY_OBCM_RDSS_LEN (1u)

/** \brief Mask for Ifx_ERAY_OBCM_Bits.RDSS */
#define IFX_ERAY_OBCM_RDSS_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_OBCM_Bits.RDSS */
#define IFX_ERAY_OBCM_RDSS_OFF (1u)

/** \brief Length for Ifx_ERAY_OBCM_Bits.RHSH */
#define IFX_ERAY_OBCM_RHSH_LEN (1u)

/** \brief Mask for Ifx_ERAY_OBCM_Bits.RHSH */
#define IFX_ERAY_OBCM_RHSH_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_OBCM_Bits.RHSH */
#define IFX_ERAY_OBCM_RHSH_OFF (16u)

/** \brief Length for Ifx_ERAY_OBCM_Bits.RDSH */
#define IFX_ERAY_OBCM_RDSH_LEN (1u)

/** \brief Mask for Ifx_ERAY_OBCM_Bits.RDSH */
#define IFX_ERAY_OBCM_RDSH_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_OBCM_Bits.RDSH */
#define IFX_ERAY_OBCM_RDSH_OFF (17u)

/** \brief Length for Ifx_ERAY_OBCR_Bits.OBRS */
#define IFX_ERAY_OBCR_OBRS_LEN (7u)

/** \brief Mask for Ifx_ERAY_OBCR_Bits.OBRS */
#define IFX_ERAY_OBCR_OBRS_MSK (0x7fu)

/** \brief Offset for Ifx_ERAY_OBCR_Bits.OBRS */
#define IFX_ERAY_OBCR_OBRS_OFF (0u)

/** \brief Length for Ifx_ERAY_OBCR_Bits.VIEW */
#define IFX_ERAY_OBCR_VIEW_LEN (1u)

/** \brief Mask for Ifx_ERAY_OBCR_Bits.VIEW */
#define IFX_ERAY_OBCR_VIEW_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_OBCR_Bits.VIEW */
#define IFX_ERAY_OBCR_VIEW_OFF (8u)

/** \brief Length for Ifx_ERAY_OBCR_Bits.REQ */
#define IFX_ERAY_OBCR_REQ_LEN (1u)

/** \brief Mask for Ifx_ERAY_OBCR_Bits.REQ */
#define IFX_ERAY_OBCR_REQ_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_OBCR_Bits.REQ */
#define IFX_ERAY_OBCR_REQ_OFF (9u)

/** \brief Length for Ifx_ERAY_OBCR_Bits.OBSYS */
#define IFX_ERAY_OBCR_OBSYS_LEN (1u)

/** \brief Mask for Ifx_ERAY_OBCR_Bits.OBSYS */
#define IFX_ERAY_OBCR_OBSYS_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_OBCR_Bits.OBSYS */
#define IFX_ERAY_OBCR_OBSYS_OFF (15u)

/** \brief Length for Ifx_ERAY_OBCR_Bits.OBRH */
#define IFX_ERAY_OBCR_OBRH_LEN (7u)

/** \brief Mask for Ifx_ERAY_OBCR_Bits.OBRH */
#define IFX_ERAY_OBCR_OBRH_MSK (0x7fu)

/** \brief Offset for Ifx_ERAY_OBCR_Bits.OBRH */
#define IFX_ERAY_OBCR_OBRH_OFF (16u)

/** \brief Length for Ifx_ERAY_OTSS_Bits.OTGB0 */
#define IFX_ERAY_OTSS_OTGB0_LEN (2u)

